Управление_пожарной_частью_/src/DataProcessors/ЗагрузкаИзExcelБоеваяПодготовка/ЗагрузкаИзExcelБоеваяПодготовка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаИзExcelБоеваяПодготовка</name>
</mdclass:DataProcessor>

Управление_пожарной_частью_/src/Enums/Оценка/Оценка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Оценка</name>
  <enumValues>
    <name>Удовлетворительно</name>
  </enumValues>
  <enumValues>
    <name>Хорошо</name>
  </enumValues>
  <enumValues>
    <name>Отлично</name>
  </enumValues>
  <enumValues>
    <name>Сдал</name>
  </enumValues>
  <enumValues>
    <name>НеСдал</name>
  </enumValues>
</mdclass:Enum>

Управление_пожарной_частью_/src/Catalogs/Норматив/Норматив.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Норматив</name>
  <tabularSections>
    <name>Значения</name>
    <attributes>
      <name>ВозрастнаяГруппа</name>
      <type>
        <types>CatalogRef.ВозрастныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>EnumRef.Оценка</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_пожарной_частью_/src/DataProcessors/ЗагрузкаИзExcelБоеваяПодготовка/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СсылкаНаФайлНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Попытка
		Оповещение = Новый ОписаниеОповещения("ЗагрузкаДанных", ЭтотОбъект);
		НачатьПомещениеФайлаНаСервер(Оповещение,,,,,УникальныйИдентификатор);
	Исключение
		ПредупреждениеАсинх("Проверьте не открыт ли файл в другом приложении");
	КонецПопытки;
КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузкаДанных(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	СсылкаНаФайл = ОписаниеПомещенногоФайла.СсылкаНаФайл.Файл.ПолноеИмя;
КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузитьНормативы(Команда)
	Если ПустаяСтрока(СсылкаНаФайл) Тогда
		Сообщить("Укажите путь к файлу");
		Возврат;
	КонецЕсли;
	ИмпортНормативов(СсылкаНаФайл);
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаСервере
Процедура ИмпортНормативов(ПутьКФайлу)
	
	ТабДок = Новый ТабличныйДокумент;
	Попытка
		ТабДок.Прочитать(ПутьКФайлу);
	Исключение
		Сообщить("Не удалось прочитать файл: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	
	ТекущееУпражнение = "";
	КоличествоЗагружено = 0;
	НормативЭлемент = Неопределено;
	
	Для НомерСтроки = 2 По КоличествоСтрок Цикл
		
		Попытка
			Упражнение = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C1").ТекущаяОбласть.Текст));
			ВозрастнаяГруппа = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C2").ТекущаяОбласть.Текст));
			Оценка = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C3").ТекущаяОбласть.Текст));
			МинимальноеЗначение = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C4").ТекущаяОбласть.Текст));
			МаксимальноеЗначение = СокрЛП(Строка(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C5").ТекущаяОбласть.Текст));
			
			Если Упражнение <> ТекущееУпражнение Тогда
				Если НормативЭлемент <> Неопределено Тогда
					НормативЭлемент.Записать();
					Сообщить("Сохранен норматив: " + ТекущееУпражнение + ", строк: " + КоличествоЗагружено);
				КонецЕсли;
				
				НормативСсылка = Справочники.Норматив.НайтиПоНаименованию(Упражнение);
				Если НормативСсылка = Справочники.Норматив.ПустаяСсылка() Тогда
					НормативЭлемент = Справочники.Норматив.СоздатьЭлемент();
					НормативЭлемент.Наименование = Упражнение;
				Иначе
					НормативЭлемент = НормативСсылка.ПолучитьОбъект();
				КонецЕсли;
				
				НормативЭлемент.Значения.Очистить();
				
				ТекущееУпражнение = Упражнение;
				КоличествоЗагружено = 0;
			КонецЕсли;
			
			НоваяСтрока = НормативЭлемент.Значения.Добавить();
			
			ВозрастнаяГруппаСсылка = Справочники.ВозрастныеГруппы.НайтиПоНаименованию(ВозрастнаяГруппа);
			Если ВозрастнаяГруппаСсылка = Справочники.ВозрастныеГруппы.ПустаяСсылка() Тогда
				НоваяСтрока.ВозрастнаяГруппа = ВозрастнаяГруппа;
			Иначе
				НоваяСтрока.ВозрастнаяГруппа = ВозрастнаяГруппаСсылка;
			КонецЕсли;
			
			Если Оценка = "Хорошо" Тогда
				НоваяСтрока.Оценка = Перечисления.Оценка.Хорошо;
			ИначеЕсли Оценка = "Удовлетворительно" Тогда
				НоваяСтрока.Оценка = Перечисления.Оценка.Удовлетворительно;	
			ИначеЕсли Оценка = "Отлично" Тогда
				НоваяСтрока.Оценка = Перечисления.Оценка.Отлично;	
			КонецЕсли;
			
			Если Не ПустаяСтрока(МинимальноеЗначение) Тогда
				МинимальноеЗначение = СтрЗаменить(МинимальноеЗначение, ",", ".");
				Попытка
					НоваяСтрока.МинимальноеЗначение = Число(МинимальноеЗначение);
				Исключение
					НоваяСтрока.МинимальноеЗначение = 0;
				КонецПопытки;
			КонецЕсли;
			
			Если Не ПустаяСтрока(МаксимальноеЗначение) Тогда
				МаксимальноеЗначение = СтрЗаменить(МаксимальноеЗначение, ",", ".");
				Попытка
					НоваяСтрока.МаксимальноеЗначение = Число(МаксимальноеЗначение);
				Исключение
					НоваяСтрока.МаксимальноеЗначение = 0;
				КонецПопытки;
			КонецЕсли;
			
			КоличествоЗагружено = КоличествоЗагружено + 1;
			
		Исключение
			Сообщить("Ошибка в строке " + НомерСтроки + ": " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	Если НормативЭлемент <> Неопределено Тогда
		НормативЭлемент.Записать();
		Сообщить("Успешно загружено! Норматив: " + ТекущееУпражнение + ", строк: " + КоличествоЗагружено);
	КонецЕсли;
	
КонецПроцедуры
